[error]
1=卡未初始化或找不到卡！
2=復位失敗！
3=卡版本不對！
4=報警！
6=執行失敗！
7=狀態不對應!
16=命令超時！
17=命令丟失!
18=介面調用非同步！
19=介面被其他程式佔用!
20=Z軸超限或校正文件損壞！
21=參數不匹配!
23=記憶體分配失敗!
100=脫機使用中!
101=命令被中止!

[4]
1 = 雷射器過溫，請關閉電源！
2 = 雷射器高反報警，請關閉電源！
3 = 雷射器MO異常，請關閉電源！
4 = 雷射器蓋子被打開，請關閉電源並裝好雷射器蓋子！
5 = 安全門被打開，請關上安全門！
6 = 光閘關閉異常，請關閉電源並檢查光閘！
7 = 光閘打開異常，請關閉電源並檢查光閘！
8 = 安全門被打開，打標暫停，請關上安全門繼續打標！
9 = 安全門被打開，打標中止！
10= 雷射器系統報警，請關閉電源！
11= 雷射器電源電壓超範圍，請關閉電源！
12= 雷射器電源過壓報警，請關閉電源並檢查雷射器電源！
13= 雷射器電源欠壓報警，請關閉電源並檢查雷射器電源！
14= SPI雷射器過溫報警，請關閉電源！
15= SPI雷射器預備放大器過流報警，請關閉電源！
16= SPI雷射器功率放大器過流報警，請關閉電源！
17= SPI雷射器准直雷射器報警，請關閉電源！
18= SPI雷射器保留報警，請關閉電源！
19= SPI雷射器電源報警，請關閉電源！
20= 雷射器未知報警，請關閉電源！
21= 雷射器電源過流報警，請關閉電源！
22= 雷射器電源過壓報警，請關閉電源！
23= 雷射器電源過溫報警，請關閉電源並檢查散熱條件！
24= 雷射器電源未打開，請檢查電源。
100=安全門有效且被打開!

110=碰到負限位!
111=碰到正限位!
112=運動中碰到原點!
500=振鏡預熱中，請稍侯再試!

[door]
1=安全門被打開，請關上安全門！
2=安全門被打開，打標暫停，請關上安全門繼續打標！
3=安全門被打開，打標中止！
4=安全門已關上,可以繼續打標！
5=安全門已關上,狀態正常！
6=運動過程中碰到負限位，打標被中止！
7=運動過程中碰到正限位，打標被中止！

[usb]
1=EMCC卡已經連接
2=EMCC卡已經斷開
